In [1]:
%load_ext sql

In [2]:
import pandas as pd
import MySQLdb

In [3]:
%sql mysql://root:rosha20170205%@localhost:3306/Chinook

'Connected: root@Chinook'

In [4]:
%sql SHOW tables;

 * mysql://root:***@localhost:3306/Chinook
11 rows affected.

[('Album',),
 ('Artist',),
 ('Customer',),
 ('Employee',),
 ('Genre',),
 ('Invoice',),
 ('InvoiceLine',),
 ('MediaType',),
 ('Playlist',),
 ('PlaylistTrack',),
 ('Track',)]

In [5]:
%sql DESCRIBE Genre;

 * mysql://root:***@localhost:3306/Chinook
2 rows affected.

[('GenreId', 'int', 'NO', 'PRI', None, ''),
 ('Name', 'varchar(120)', 'YES', '', None, '')]

In [6]:
%sql DESCRIBE Invoice;

 * mysql://root:***@localhost:3306/Chinook
9 rows affected.

[('InvoiceId', 'int', 'NO', 'PRI', None, ''),
 ('CustomerId', 'int', 'NO', 'MUL', None, ''),
 ('InvoiceDate', 'datetime', 'NO', '', None, ''),
 ('BillingAddress', 'varchar(70)', 'YES', '', None, ''),
 ('BillingCity', 'varchar(40)', 'YES', '', None, ''),
 ('BillingState', 'varchar(40)', 'YES', '', None, ''),
 ('BillingCountry', 'varchar(40)', 'YES', '', None, ''),
 ('BillingPostalCode', 'varchar(10)', 'YES', '', None, ''),
 ('Total', 'decimal(10,2)', 'NO', '', None, '')]

In [7]:
%sql SELECT * FROM Invoice LIMIT 10;

 * mysql://root:***@localhost:3306/Chinook
10 rows affected.

[(1, 2, datetime.datetime(2009, 1, 1, 0, 0), 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', Decimal('1.98')),
 (2, 4, datetime.datetime(2009, 1, 2, 0, 0), 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', Decimal('3.96')),
 (3, 8, datetime.datetime(2009, 1, 3, 0, 0), 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', Decimal('5.94')),
 (4, 14, datetime.datetime(2009, 1, 6, 0, 0), '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', Decimal('8.91')),
 (5, 23, datetime.datetime(2009, 1, 11, 0, 0), '69 Salem Street', 'Boston', 'MA', 'USA', '2113', Decimal('13.86')),
 (6, 37, datetime.datetime(2009, 1, 19, 0, 0), 'Berger Straße 10', 'Frankfurt', None, 'Germany', '60316', Decimal('0.99')),
 (7, 38, datetime.datetime(2009, 2, 1, 0, 0), 'Barbarossastraße 19', 'Berlin', None, 'Germany', '10779', Decimal('1.98')),
 (8, 40, datetime.datetime(2009, 2, 1, 0, 0), '8, Rue Hanovre', 'Paris', None, 'France', '75002', Decimal('1.98')),
 (9, 42, datetime.datetime(2009, 2, 2, 0, 0), '9, Place Louis Barthou', 'Bordeaux', None, 'France', '33000', Decimal('3.96')),
 (10, 46, datetime.datetime(2009, 2, 3, 0, 0), '3 Chatham Street', 'Dublin', 'Dublin', 'Ireland', None, Decimal('5.94'))]

In [10]:
info = %sql SELECT CustomerId, MONTH(InvoiceDate) AS Month FROM Invoice LIMIT 10;

 * mysql://root:***@localhost:3306/Chinook
10 rows affected.

In [11]:
info.csv('test.csv')

CSV results at /Users/ehsan/Documents/Repo/data-science-training/test.csv

In [12]:
%sql SELECT DISTINCT BillingState FROM Invoice;

 * mysql://root:***@localhost:3306/Chinook
26 rows affected.

[(None,),
 ('AB',),
 ('MA',),
 ('Dublin',),
 ('CA',),
 ('WA',),
 ('NV',),
 ('WI',),
 ('NS',),
 ('NSW',),
 ('SP',),
 ('NT',),
 ('VV',),
 ('RJ',),
 ('DF',),
 ('BC',),
 ('AZ',),
 ('ON',),
 ('MB',),
 ('RM',),
 ('TX',),
 ('UT',),
 ('FL',),
 ('IL',),
 ('QC',),
 ('NY',)]

In [13]:
%sql SHOW tables;

 * mysql://root:***@localhost:3306/Chinook
11 rows affected.

[('Album',),
 ('Artist',),
 ('Customer',),
 ('Employee',),
 ('Genre',),
 ('Invoice',),
 ('InvoiceLine',),
 ('MediaType',),
 ('Playlist',),
 ('PlaylistTrack',),
 ('Track',)]

In [14]:
%sql DESCRIBE Track;

 * mysql://root:***@localhost:3306/Chinook
9 rows affected.

[('TrackId', 'int', 'NO', 'PRI', None, ''),
 ('Name', 'varchar(200)', 'NO', '', None, ''),
 ('AlbumId', 'int', 'YES', 'MUL', None, ''),
 ('MediaTypeId', 'int', 'NO', 'MUL', None, ''),
 ('GenreId', 'int', 'YES', 'MUL', None, ''),
 ('Composer', 'varchar(220)', 'YES', '', None, ''),
 ('Milliseconds', 'int', 'NO', '', None, ''),
 ('Bytes', 'int', 'YES', '', None, ''),
 ('UnitPrice', 'decimal(10,2)', 'NO', '', None, '')]

In [17]:
%sql SELECT * FROM Track LIMIT 20;

 * mysql://root:***@localhost:3306/Chinook
20 rows affected.

[(1, 'For Those About To Rock (We Salute You)', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 343719, 11170334, Decimal('0.99')),
 (2, 'Balls to the Wall', 2, 2, 1, None, 342562, 5510424, Decimal('0.99')),
 (3, 'Fast As a Shark', 3, 2, 1, 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 230619, 3990994, Decimal('0.99')),
 (4, 'Restless and Wild', 3, 2, 1, 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 252051, 4331779, Decimal('0.99')),
 (5, 'Princess of the Dawn', 3, 2, 1, 'Deaffy & R.A. Smith-Diesel', 375418, 6290521, Decimal('0.99')),
 (6, 'Put The Finger On You', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 205662, 6713451, Decimal('0.99')),
 (7, "Let's Get It Up", 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 233926, 7636561, Decimal('0.99')),
 (8, 'Inject The Venom', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 210834, 6852860, Decimal('0.99')),
 (9, 'Snowballed', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 203102, 6599424, Decimal('0.99')),
 (10, 'Evil Walks', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 263497, 8611245, Decimal('0.99')),
 (11, 'C.O.D.', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 199836, 6566314, Decimal('0.99')),
 (12, 'Breaking The Rules', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 263288, 8596840, Decimal('0.99')),
 (13, 'Night Of The Long Knives', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 205688, 6706347, Decimal('0.99')),
 (14, 'Spellbound', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 270863, 8817038, Decimal('0.99')),
 (15, 'Go Down', 4, 1, 1, 'AC/DC', 331180, 10847611, Decimal('0.99')),
 (16, 'Dog Eat Dog', 4, 1, 1, 'AC/DC', 215196, 7032162, Decimal('0.99')),
 (17, 'Let There Be Rock', 4, 1, 1, 'AC/DC', 366654, 12021261, Decimal('0.99')),
 (18, 'Bad Boy Boogie', 4, 1, 1, 'AC/DC', 267728, 8776140, Decimal('0.99')),
 (19, 'Problem Child', 4, 1, 1, 'AC/DC', 325041, 10617116, Decimal('0.99')),
 (20, 'Overdose', 4, 1, 1, 'AC/DC', 369319, 12066294, Decimal('0.99'))]

In [18]:
%sql SELECT TrackID, UPPER(Name) AS NameUpper, (Milliseconds / 60000) AS LenMinutes FROM Track ORDER BY Name ASC LIMIT 20;

 * mysql://root:***@localhost:3306/Chinook
20 rows affected.

[(3027, '"40"', Decimal('2.6327')),
 (2918, '"?"', Decimal('46.3722')),
 (3412, '"EINE KLEINE NACHTMUSIK" SERENADE IN G, K. 525: I. ALLEGRO', Decimal('5.8162')),
 (109, '#1 ZERO', Decimal('4.9850')),
 (3254, '#9 DREAM', Decimal('4.6385')),
 (602, "'ROUND MIDNIGHT", Decimal('5.9577')),
 (1833, '(ANESTHESIA) PULLING TEETH', Decimal('4.2493')),
 (570, '(DA LE) YALEO', Decimal('5.8915')),
 (3045, "(I CAN'T HELP) FALLING IN LOVE WITH YOU", Decimal('3.4595')),
 (3057, '(OH) PRETTY WOMAN', Decimal('2.9113')),
 (3471, '(THERE IS) NO GREATER LOVE (TEO LICKS)', Decimal('2.7989')),
 (1947, '(WE ARE) THE ROAD CREW', Decimal('3.2100')),
 (2595, '(WHITE MAN) IN HAMMERSMITH PALAIS', Decimal('4.0107')),
 (709, '(WISH I COULD) HIDEAWAY', Decimal('3.8078')),
 (2869, '...AND FOUND', Decimal('42.7306')),
 (1894, '...AND JUSTICE FOR ALL', Decimal('9.7628')),
 (2906, '...IN TRANSLATION', Decimal('43.4096')),
 (3166, '.07%', Decimal('43.0966')),
 (1268, '01 - PROWLER', Decimal('3.9362')),
 (1269, '02 - SANCTUARY', Decimal('3.2714'))]